{
  "name": "LitRitt's Source",
  "subtitle": "The home of all things Lit.",
  "description": "This source gives you access to the Ignited Emulator, an enhanced fork of Delta with many new features and QoL changes.",
  "iconURL": "https://f005.backblazeb2.com/file/lit-apps/assets/ignited/icon-1024.png",
  "headerURL": "https://f005.backblazeb2.com/file/lit-apps/assets/ignited/icon-1024.png",
  "website": "https://litritt.com",
  "tintColor": "#FF6A00",
  "featuredApps": [
      "com.litritt.ignited"
  ],
  "apps": [
      {
          "name": "Ignited",
          "bundleIdentifier": "com.litritt.ignited",
          "developerName": "LitRitt",
          "subtitle": "Retro games meet modern design.",
          "localizedDescription": "Ignited is an overhaul of Delta, an all-in-one emulator for iOS, set ablaze with new features and QoL enhancements.\n\nFEATURES\n\nSupported Game Systems\n• Nintendo Entertainment System\n• Super Nintendo Entertainment System\n• Sega Genesis\n• Nintendo 64\n• Game Boy (Color)\n• Game Boy Advance\n• Nintendo DS\n\nController Support\n• Supports PS4, PS5, Xbox One S, Xbox Series X, Switch, and MFi game controllers.\n• Supports bluetooth (and wired) keyboards, as well as the Apple Smart Keyboard.\n• Completely customize button mappings on a per-system, per-controller basis.\n• Map buttons to special \"Quick Save\", \"Quick Load,\" and \"Fast Forward\" actions.\n\nSave States\n• Save and load save states for any game from the pause menu.\n• Lock save states to prevent them from being accidentally overwritten.\n• Automatically makes backup save states to ensure you never lose your progress.\n• Support for \"Quick Saves,\" save states that can be quickly saved/loaded with a single button press (requires external controller or supported skin).\n• Save State Rewind - Rolling save states that can be rewound to for up to 2 minutes. Configurable interval. (Currently disabled)\n\nCheats\n• Supports various types of cheat codes for each supported system:\n• NES: Game Genie\n• SNES: Game Genie, Pro Action Replay\n• N64: GameShark\n• GBC: Game Genie, GameShark\n• GBA: Action Replay, Code Breaker, GameShark\n• DS: Action Replay\n\nIgnited Sync\n• Sync your games, game saves, save states, cheats, controller skins, and controller mappings between devices.\n• View version histories of everything you sync and optionally restore them to earlier versions.\n• Supports both Google Drive and Dropbox.\n\nCustom Controller Skins\n• Beautiful built-in controller skins for all systems.\n• Import controller skins made by others, or even make your own to share with the world!\n\nHold Button\n• Choose buttons for Delta to hold down on your behalf, freeing up your thumbs to press other buttons instead.\n• Perfect for games that typically require one button be held down constantly (ex: run button in Mario games, or the A button in Mario Kart).\n\nFast Forward\n• Speed through slower parts of games by running the game much faster than normal.\n• Easily enable or disable from the pause menu, or optionally with a mapped button on an external controller.\n\n3D/Haptic Touch\n• Use 3D or Haptic Touch to \"peek\" at games, save states, and cheat codes.\n• App icon shortcuts allow quick access to your most recently played games, or optionally customize the shortcuts to always include certain games.\n\nGame Artwork\n• Automatically displays appropriate box art for imported games.\n• Change a game's artwork to anything you want, or select from the built-in game artwork database.\n• Support for animated GIFs\n\nMisc.\n• Gyroscope support (WarioWare: Twisted! only)\n• Microphone support (DS only)\n• Support for ignited:// URL scheme to jump directly into a specific game.\n\n**Ignited and LitRitt are in no way affiliated with Nintendo. The name \"Nintendo\" and all associated game console names are registered trademarks of Nintendo Co., Ltd.**",
          "iconURL": "https://f005.backblazeb2.com/file/lit-apps/assets/ignited/icon-1024.png",
          "tintColor": "#FF6A00",
          "screenshots": [
              "https://f005.backblazeb2.com/file/lit-apps/assets/ignited/gameplay.jpg",
              "https://f005.backblazeb2.com/file/lit-apps/assets/ignited/library.jpg",
              "https://f005.backblazeb2.com/file/lit-apps/assets/ignited/quick-settings.jpg",
              "https://f005.backblazeb2.com/file/lit-apps/assets/ignited/settings.jpg"
          ],
          "versions": [
              {
                  "version": "1.5.6",
                  "date": "2023-10-27T09:00:00-08:00",
                  "size": 55199847,
                  "downloadURL": "https://f005.backblazeb2.com/file/lit-apps/ignited/1.5.6/Ignited.ipa",
                  "localizedDescription": "New Features\n• Adds support for dynamic background blur tinting based on device light/dark mode setting\n  • The background blur will be darkened in dark mode and lightened in light mode\n  • Intensity of the tint can also be adjusted\n•Updates\n• Makes DSi support toggle-able\n  • Users won't be able to add DSi BIOS files until toggling DSi support on first\n  • The DSi NAND file will be removed when DSi support is toggled off to remove the DSi Home Screen\n• Moves Core Settings below Features in the settings page",
                  "minOSVersion": "14.0"
              }
          ],
          "appPermissions": {
              "privacy": {
                  "NSLocalNetworkUsageDescription": "Ignited uses the local network to communicate with AltServer and enable JIT.",
                  "NSPhotoLibraryUsageDescription": "Ignited saves game screenshots to your Photo Library, and also can use photos as game artwork.",
                  "NSMicrophoneUsageDescription": "Ignited uses your microphone to emulate the Nintendo DS microphone."
              }
          }
      }
  ],
  "news": [
      {
          "title": "Ignited Dynamic Background Blur",
          "identifier": "ignited_dynamic_blur",
          "caption": "Background blurs for skins can now be dynamically tinted based on the device's light/dark mode setting.",
          "date": "2023-10-27",
          "tintColor": "#429377",
          "imageURL": "https://f005.backblazeb2.com/file/lit-apps/assets/ignited/ignited_dynamic_blur.png",
          "notify": true,
          "url": "https://github.com/LitRitt/Ignited/releases/tag/v1.5.6"
      },
      {
          "title": "Source Updated for AltStore 2.0",
          "identifier": "litritt_source_update",
          "caption": "Enjoy a satisfying and safe experience using the new source.",
          "date": "2023-03-10T10:00:00-07:00",
          "tintColor": "#FF6A00",
          "notify": false,
          "appID": "com.litritt.ignited"
      }
  ]
}